NextFOAM-2501/tutorials/incompressible/pimpleFoam/laminar/inclinedPlaneFilm/0/Uf_film
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       areaVectorField;
    object      Uf_film;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    side
    {
        type            fixedValue;
        value           $internalField;
    }

    symmetry
    {
        type            fixedValue;
        value           $internalField;
    }

    cylinder
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
